IDENTIFICATION DIVISION.
PROGRAM-ID. DEPEND.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-SEL  PIC 9(3) VALUE 0.
01 WS-I    PIC 9(3) VALUE 0.

PROCEDURE DIVISION.
MAIN.
    MOVE 1 TO WS-I.
LOOP-TOP.
    IF WS-I > 4
        GO TO ENDP
    END-IF.
    MOVE WS-I TO WS-SEL.
    GO TO OPT-A OPT-B OPT-C DEPENDING ON WS-SEL.
    DISPLAY WS-I " -> default".
    GO TO NEXT-IT.
OPT-A.
    DISPLAY WS-I " -> A".
    GO TO NEXT-IT.
OPT-B.
    DISPLAY WS-I " -> B".
    GO TO NEXT-IT.
OPT-C.
    DISPLAY WS-I " -> C".
    GO TO NEXT-IT.
NEXT-IT.
    ADD 1 TO WS-I.
    GO TO LOOP-TOP.
ENDP.
    STOP RUN.
